test_git.html

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:ns1="http://gsxws.apple.com/elements/iphone">
    <SOAP-ENV:Body>
        <ns1:CreateIPhoneCarryInRepair>
            <CreateIPhoneCarryInRepairRequest>
                <userSession>
                    <userSessionId>ZWUMepQI1Ze3XXKFmNvzab</userSessionId>
                </userSession>
                <repairData>
                    <alternateDeviceId>356131091232275</alternateDeviceId>
                    <unitReceivedDate>19/11/19</unitReceivedDate>
                    <unitReceivedTime>14:58</unitReceivedTime>
                    <requestReviewByApple>N</requestReviewByApple>
                    <diagnosis>poste rayé</diagnosis>
                    <symptom>Tout dommage physique sur le boîtier (rayures, etc..)</symptom>
                    <notes>poste rayé</notes>
                    <shipTo>0000658471</shipTo>
                    <poNumber>81052120</poNumber>
                    <referenceNumber>81052120</referenceNumber>
                    <popFaxed>N</popFaxed>
                    <checkIfOutOfWarrantyCoverage>N</checkIfOutOfWarrantyCoverage>
                    <overrideDiagnosticCodeCheck>N</overrideDiagnosticCodeCheck>
                    <customerAddress>
                        <addressLine1>160 GRANDE RUE</addressLine1>
                        <addressLine2> ROMAO</addressLine2>
                        <country>FR</country>
                        <zipCode>73210</zipCode>
                        <regionCode>004</regionCode>
                        <city>AIME</city>
                        <state></state>
                        <street></street>
                        <firstName> .</firstName>
                        <lastName>ROMAO PAULO</lastName>
                        <companyName>ALLIANZ FRANCE</companyName>
                        <primaryPhone>0629182738</primaryPhone>
                        <emailAddress>refused@apple.com</emailAddress>
                    </customerAddress>
                    <orderLines>
                        <partNumber>DN661-07440</partNumber>
                        <comptiaCode>B91</comptiaCode>
                        <comptiaModifier>G</comptiaModifier>
                        <returnableDamage></returnableDamage>
                    </orderLines>
                    <reportedSymptomCode>26112B</reportedSymptomCode>
                    <reportedIssueCode>IP279</reportedIssueCode>
                </repairData>
            </CreateIPhoneCarryInRepairRequest>
        </ns1:CreateIPhoneCarryInRepair>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
